OpenFOAM/WFD_OpenFOAM/cases/batch_002/baseline_pitch_8p5_chord_0p4_0p6_0p25/0/include/frontBackUpperPatches
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

upperWall
{
    type symmetryPlane;
}

"(front|back)"
{
    type symmetryPlane;
}

// ************************************************************************* //
